Revit 2024 API
DirectShapeType.IsValidUsage Method
 Validates that the ExternallyTaggedGeometryObject's usage is set to an allowed value for a DirectShapeType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool IsValidUsage(
	ExternallyTaggedGeometryObject externallyTaggedGeometry
)
Visual Basic
Public Function IsValidUsage ( _
	externallyTaggedGeometry As ExternallyTaggedGeometryObject _
) As Boolean
Visual C++
public:
bool IsValidUsage(
	ExternallyTaggedGeometryObject^ externallyTaggedGeometry
)
Parameters
externallyTaggedGeometry
Type: Autodesk.Revit.DB.ExternallyTaggedGeometryObject
 The geometry to check.
Return Value
 True if the usage is permitted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace